node {
  name: "random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "+\000\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal/mul"
  op: "Mul"
  input: "random_normal/RandomStandardNormal"
  input: "random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal"
  op: "Add"
  input: "random_normal/mul"
  input: "random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "W_In"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 43
        }
        dim {
          size: 100
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "W_In/Assign"
  op: "Assign"
  input: "W_In"
  input: "random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_In"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "W_In/read"
  op: "Identity"
  input: "W_In"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_In"
      }
    }
  }
}
node {
  name: "random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal_1/mul"
  op: "Mul"
  input: "random_normal_1/RandomStandardNormal"
  input: "random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal_1"
  op: "Add"
  input: "random_normal_1/mul"
  input: "random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "W_Hidd"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 100
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "W_Hidd/Assign"
  op: "Assign"
  input: "W_Hidd"
  input: "random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_Hidd"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "W_Hidd/read"
  op: "Identity"
  input: "W_Hidd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_Hidd"
      }
    }
  }
}
node {
  name: "random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "random_normal_2/mul"
  op: "Mul"
  input: "random_normal_2/RandomStandardNormal"
  input: "random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "random_normal_2"
  op: "Add"
  input: "random_normal_2/mul"
  input: "random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "W_Out"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "W_Out/Assign"
  op: "Assign"
  input: "W_Out"
  input: "random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_Out"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "W_Out/read"
  op: "Identity"
  input: "W_Out"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@W_Out"
      }
    }
  }
}
node {
  name: "zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 100
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "B_In"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "B_In/Assign"
  op: "Assign"
  input: "B_In"
  input: "zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_In"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "B_In/read"
  op: "Identity"
  input: "B_In"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_In"
      }
    }
  }
}
node {
  name: "zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 100
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "B_Hidd"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "B_Hidd/Assign"
  op: "Assign"
  input: "B_Hidd"
  input: "zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_Hidd"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "B_Hidd/read"
  op: "Identity"
  input: "B_Hidd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_Hidd"
      }
    }
  }
}
node {
  name: "zeros_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "B_Out"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "B_Out/Assign"
  op: "Assign"
  input: "B_Out"
  input: "zeros_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_Out"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "B_Out/read"
  op: "Identity"
  input: "B_Out"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@B_Out"
      }
    }
  }
}
node {
  name: "placeholders/input_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 43
        }
      }
    }
  }
}
node {
  name: "placeholders/one_hot_labels_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "placeholders/previous_hidden_layer_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 100
        }
      }
    }
  }
}
node {
  name: "input_propagation/MatMul"
  op: "MatMul"
  input: "placeholders/input_placeholder"
  input: "W_In/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "input_propagation/Add"
  op: "Add"
  input: "input_propagation/MatMul"
  input: "B_In/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_propagation/MatMul"
  op: "MatMul"
  input: "placeholders/previous_hidden_layer_placeholder"
  input: "W_Hidd/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_propagation/Add"
  op: "Add"
  input: "hidden_propagation/MatMul"
  input: "B_Hidd/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_propagation/Add_1"
  op: "Add"
  input: "input_propagation/Add"
  input: "hidden_propagation/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_propagation/Sigmoid"
  op: "Sigmoid"
  input: "hidden_propagation/Add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "logit_output/MatMul"
  op: "MatMul"
  input: "hidden_propagation/Sigmoid"
  input: "W_Out/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "logit_output/Add"
  op: "Add"
  input: "logit_output/MatMul"
  input: "B_Out/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "prediction_and_loss/output"
  op: "Softmax"
  input: "logit_output/Add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/labels_stop_gradient"
  op: "StopGradient"
  input: "placeholders/one_hot_labels_placeholder"
  attr {
    key: "T"
    value {
      type: DT_INT8
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Cast"
  op: "Cast"
  input: "prediction_and_loss/sparse_softmax_loss_function/labels_stop_gradient"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT8
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub"
  op: "Sub"
  input: "prediction_and_loss/sparse_softmax_loss_function/Rank_1"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice/begin"
  op: "Pack"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice"
  op: "Slice"
  input: "prediction_and_loss/sparse_softmax_loss_function/Shape_1"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice/begin"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat"
  op: "ConcatV2"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat/values_0"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Reshape"
  op: "Reshape"
  input: "logit_output/Add"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Shape_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub_1"
  op: "Sub"
  input: "prediction_and_loss/sparse_softmax_loss_function/Rank_2"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_1/begin"
  op: "Pack"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub_1"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_1"
  op: "Slice"
  input: "prediction_and_loss/sparse_softmax_loss_function/Shape_2"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_1/begin"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_1/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat_1/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/concat_1"
  op: "ConcatV2"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat_1/values_0"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_1"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Reshape_1"
  op: "Reshape"
  input: "prediction_and_loss/sparse_softmax_loss_function/Cast"
  input: "prediction_and_loss/sparse_softmax_loss_function/concat_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function"
  op: "SoftmaxCrossEntropyWithLogits"
  input: "prediction_and_loss/sparse_softmax_loss_function/Reshape"
  input: "prediction_and_loss/sparse_softmax_loss_function/Reshape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Sub_2"
  op: "Sub"
  input: "prediction_and_loss/sparse_softmax_loss_function/Rank"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_2/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_2/size"
  op: "Pack"
  input: "prediction_and_loss/sparse_softmax_loss_function/Sub_2"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Slice_2"
  op: "Slice"
  input: "prediction_and_loss/sparse_softmax_loss_function/Shape"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_2/begin"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_2/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/sparse_softmax_loss_function/Reshape_2"
  op: "Reshape"
  input: "prediction_and_loss/sparse_softmax_loss_function"
  input: "prediction_and_loss/sparse_softmax_loss_function/Slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "prediction_and_loss/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "prediction_and_loss/Mean"
  op: "Mean"
  input: "prediction_and_loss/sparse_softmax_loss_function/Reshape_2"
  input: "prediction_and_loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train/gradients/grad_ys_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train/gradients/Fill"
  op: "Fill"
  input: "train/gradients/Shape"
  input: "train/gradients/grad_ys_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/Fill"
  input: "train/gradients/prediction_and_loss/Mean_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/Tile"
  op: "Tile"
  input: "train/gradients/prediction_and_loss/Mean_grad/Reshape"
  input: "train/gradients/prediction_and_loss/Mean_grad/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/Mean_grad/truediv"
  op: "RealDiv"
  input: "train/gradients/prediction_and_loss/Mean_grad/Tile"
  input: "train/gradients/prediction_and_loss/Mean_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_2_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_2_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/prediction_and_loss/Mean_grad/truediv"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_2_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/zeros_like"
  op: "ZerosLike"
  input: "prediction_and_loss/sparse_softmax_loss_function:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims"
  op: "ExpandDims"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_2_grad/Reshape"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul"
  op: "Mul"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims"
  input: "prediction_and_loss/sparse_softmax_loss_function:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/LogSoftmax"
  op: "LogSoftmax"
  input: "prediction_and_loss/sparse_softmax_loss_function/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/Neg"
  op: "Neg"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/LogSoftmax"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims_1"
  op: "ExpandDims"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_2_grad/Reshape"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul_1"
  op: "Mul"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/ExpandDims_1"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul"
  input: "^train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul_1"
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul"
  input: "^train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul"
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul_1"
  input: "^train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/mul_1"
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function_grad/tuple/control_dependency"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "train/gradients/logit_output/Add_grad/Shape"
  input: "train/gradients/logit_output/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Sum"
  op: "Sum"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_grad/Reshape"
  input: "train/gradients/logit_output/Add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/logit_output/Add_grad/Sum"
  input: "train/gradients/logit_output/Add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Sum_1"
  op: "Sum"
  input: "train/gradients/prediction_and_loss/sparse_softmax_loss_function/Reshape_grad/Reshape"
  input: "train/gradients/logit_output/Add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/Reshape_1"
  op: "Reshape"
  input: "train/gradients/logit_output/Add_grad/Sum_1"
  input: "train/gradients/logit_output/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/logit_output/Add_grad/Reshape"
  input: "^train/gradients/logit_output/Add_grad/Reshape_1"
}
node {
  name: "train/gradients/logit_output/Add_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/logit_output/Add_grad/Reshape"
  input: "^train/gradients/logit_output/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/logit_output/Add_grad/Reshape"
      }
    }
  }
}
node {
  name: "train/gradients/logit_output/Add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/logit_output/Add_grad/Reshape_1"
  input: "^train/gradients/logit_output/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/logit_output/Add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "train/gradients/logit_output/MatMul_grad/MatMul"
  op: "MatMul"
  input: "train/gradients/logit_output/Add_grad/tuple/control_dependency"
  input: "W_Out/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "train/gradients/logit_output/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "hidden_propagation/Sigmoid"
  input: "train/gradients/logit_output/Add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/logit_output/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/logit_output/MatMul_grad/MatMul"
  input: "^train/gradients/logit_output/MatMul_grad/MatMul_1"
}
node {
  name: "train/gradients/logit_output/MatMul_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/logit_output/MatMul_grad/MatMul"
  input: "^train/gradients/logit_output/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/logit_output/MatMul_grad/MatMul"
      }
    }
  }
}
node {
  name: "train/gradients/logit_output/MatMul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/logit_output/MatMul_grad/MatMul_1"
  input: "^train/gradients/logit_output/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/logit_output/MatMul_grad/MatMul_1"
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
  op: "SigmoidGrad"
  input: "hidden_propagation/Sigmoid"
  input: "train/gradients/logit_output/MatMul_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_1_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
}
node {
  name: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
  input: "^train/gradients/hidden_propagation/Add_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
  input: "^train/gradients/hidden_propagation/Add_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/hidden_propagation/Sigmoid_grad/SigmoidGrad"
      }
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 100
      }
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "train/gradients/input_propagation/Add_grad/Shape"
  input: "train/gradients/input_propagation/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Sum"
  op: "Sum"
  input: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency"
  input: "train/gradients/input_propagation/Add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/input_propagation/Add_grad/Sum"
  input: "train/gradients/input_propagation/Add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Sum_1"
  op: "Sum"
  input: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency"
  input: "train/gradients/input_propagation/Add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/Reshape_1"
  op: "Reshape"
  input: "train/gradients/input_propagation/Add_grad/Sum_1"
  input: "train/gradients/input_propagation/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/input_propagation/Add_grad/Reshape"
  input: "^train/gradients/input_propagation/Add_grad/Reshape_1"
}
node {
  name: "train/gradients/input_propagation/Add_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/input_propagation/Add_grad/Reshape"
  input: "^train/gradients/input_propagation/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/input_propagation/Add_grad/Reshape"
      }
    }
  }
}
node {
  name: "train/gradients/input_propagation/Add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/input_propagation/Add_grad/Reshape_1"
  input: "^train/gradients/input_propagation/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/input_propagation/Add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 100
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "train/gradients/hidden_propagation/Add_grad/Shape"
  input: "train/gradients/hidden_propagation/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Sum"
  op: "Sum"
  input: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency_1"
  input: "train/gradients/hidden_propagation/Add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Reshape"
  op: "Reshape"
  input: "train/gradients/hidden_propagation/Add_grad/Sum"
  input: "train/gradients/hidden_propagation/Add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Sum_1"
  op: "Sum"
  input: "train/gradients/hidden_propagation/Add_1_grad/tuple/control_dependency_1"
  input: "train/gradients/hidden_propagation/Add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/Reshape_1"
  op: "Reshape"
  input: "train/gradients/hidden_propagation/Add_grad/Sum_1"
  input: "train/gradients/hidden_propagation/Add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/gradients/hidden_propagation/Add_grad/Reshape"
  input: "^train/gradients/hidden_propagation/Add_grad/Reshape_1"
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/gradients/hidden_propagation/Add_grad/Reshape"
  input: "^train/gradients/hidden_propagation/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/hidden_propagation/Add_grad/Reshape"
      }
    }
  }
}
node {
  name: "train/gradients/hidden_propagation/Add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/gradients/hidden_propagation/Add_grad/Reshape_1"
  input: "^train/gradients/hidden_propagation/Add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/gradients/hidden_propagation/Add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "train/gradients/input_propagation/MatMul_grad/MatMul"
